1. Напишите программу, которая запрашивает ввод двух значений. Если хотя бы одно из них не
является числом (любым), то должна выполняться конкатенация, т. е. соединение, строк. В
остальных случаях введённые числа суммируются.

a,b=input("Введите первое значение: "),input("Введите второе значение: ")
try: a=int(a); b=int(b)
except: a=str(a); b=str(b)
print (a+b)


2. Написать функцию is_year_leap, принимающую 1 аргумент — год, и возвращающую True, если год високосный, и
False иначе.

def is_year_leap(year):
return year % 4 == 0 and (year % 100 != 0 or year % 400 == 0)


3. Функция принимает три числа a, b, c. Функция должна определить, существует ли треугольник с 
такими сторонами. Если треугольник существует, вернёт True, иначе False.

def tr(a,b,c):
    tr=a+b
    return tr
 
a=float(input("a= "))
b=float(input("b= "))
c=float(input("c= "))
 
if tr(a,b,c)>=c and tr(a,b,c)>=b and tr(a,b,c)>=a:
    print("True")
else:
    print("False")


4. Даны четыре действительных числа: x1, y1, x2, y2. Напишите функцию distance(x1, y1, x2, y2), 
вычисляющую расстояние между точками с координатами (x1, y1) и (x2, y2). Считайте четыре действительных 
числа от пользователя и выведите результат работы этой функции.

def distance(x1, y1, x2, y2):
    return sqrt((x1 - x2) ** 2 + (y1 - y2) ** 2)
x1 = float(input())
x2 = float(input())
y1 = float(input())
y2 = float(input())
print(distance(x1, x2, y1, y2))


5. Напишите функцию, которая удаляет все небуквенные символы внутри строки 
(ограничимся латинским алфавитом). 

import string

def dell_not_alpha(s: str):
    s1 = ""
    for char in s:
        if char in string.ascii_letters:
            s1 = s1 + char
    return s1
if __name__ == "__main__":
    a = " 1 2J,...erry!!!=78 "
print(dell_not_alpha(a))

