Задание №1
Входные данные
Пользователь вводит строку.
Выходные данные
Воспользуйтесь одним print(), но при этом выводите с новой строки:
1. Сначала выведите третий символ этой строки.
2. Во второй строке выведите предпоследний символ этой строки.
3. В третьей строке выведите первые пять символов этой строки.
4. В четвертой строке выведите всю строку, кроме последних двух символов.
5. В пятой строке выведите все символы с четными индексами (считая, что индексация начинается с 0, 
поэтому символы выводятся, начиная с первого символа).
6. В шестой строке выведите все символы с нечетными индексами, то есть начиная со второго символа строки.
7. В седьмой строке выведите все символы в обратном порядке.
8. В восьмой строке выведите все символы строки через один в обратном порядке, начиная с последнего.
9. В девятой строке выведите все символы строки через один в обратном порядке, начиная с предпоследнего.
10. В десятой строке выведите все символы в обратном порядке без первого и последнего элемента.
11. Ну, и напоследок выведите длину данной строки.

x = input()
1. print(x[2])
2. print(x[-2])
3. print(x[:5])
4. print(x[:-2])
5. print(x[::2])
6. print(x[1::2])
7. print(x[::-1])
8. print(x[::-2])
9. print(x[-2:-13:-2])
10. print(x[-2:0:-1])
11. print(len(x))


Задание №2
Пользователь вводит строку. Разрежьте её на две части – равные, если длина строки чётная, 
а если длина строки нечётная, то длина первой части должна быть на один символ больше. 
Переставьте эти две части местами, результат запишите в новую строку и выведите на экран.

c = input("Введите строку: ")
Введите строку: Forest
d = len(c)//2+len(c)%2
a = c[d:]
b = c[:d]
print(a+b)
estFor


Задание №3
Пользователь вводит целое число. Требуется определить, является ли год с данным номером 
високосным. Если год является високосным, то выведите YES, иначе выведите NO. 
Напомним, что в соответствии с григорианским календарём, год является високосным, 
если его номер кратен 4, но не кратен 100, а также если он кратен 400.

x = int(input("Введите год: "))
if (x % 4 == 0 and x % 100 != 0) or x % 400 == 0:
    print("YES")
else:
    print("NO")
Введите год: 2020
YES


Задание №4
Даны три числа a, b, c. Определите, существует ли треугольник с такими сторонами. 
Если треугольник существует, выведите строку YES, иначе выведите строку NO.

a = int(input("Введите значение для a: "))
b = int(input("Введите значение для b: "))
c = int(input("Введите значение для c: "))

if (c >= (a + b)) or (b >= (a + c)) or (a >= (b + c)):
  print ("NO")
else:
  print ("YES")

Введите значение для a: 10
Введите значение для b: 15
Введите значение для c: 20
YES


Задание №5
Дано три числа. Упорядочите их в порядке возрастания. Программа должна считывать 
три числа a, b, c, затем программа должна менять их значения так, чтобы стали выполнены 
условия a <= b <= c, затем программа выводит тройку a, b, c.
Дополнительные ограничения: нельзя использовать дополнительные переменные.

a = int(input("Введите число: "))
b = int(input("Введите число: "))
c = int(input("Введите число: "))
if (a>b): a,b = b,a
if (b>c): b,c = c,b
if (a>b): a,b = b,a
print(a, b, c)

Введите число: 5
Введите число: 10
Введите число: 15
5 10 15


Задание №6
Даны три целых числа. Определите, сколько среди них совпадающих. 
Программа должна вывести одно из чисел: 3 (если все совпадают), 2 (если два совпадает) или 
0 (если все числа различны)

a = int(input("Введите число: "))
b = int(input("Введите число: "))
c = int(input("Введите число: "))
if a == b == c:
    print(3)
elif a == b or b == c or a == c:
    print(2)
else:
    print(0)
Введите число: 5
Введите число: 5
Введите число: 10
2


Задание №7
1.Напишите счетчик с помощью конструкции while, который выводит числа от 0 до 10.

x = 0
while x <= 10:
    print(x)
    x += 1
0
1
2
3
4
5
6
7
8
9
10


Задание №8
1. Напишите цикл, который выводит на экран и удаляет с начала элементы списка, пока он не останется 
пустым.

x = [0, 1, 2, 3, 4, 5]
while x:
    print(x.pop(0))
0
1
2
3
4
5


Задание №9
1. Написать функцию is_year_leap, принимающую 1 аргумент — год, и возвращающую True, если год 
высокосный, и False иначе.
while True:
    def is_year_leap(x):
        if x % 4 == 0:
            if x % 400 == 0:
                print('True')
            elif x % 100 != 0:
                print('True')
            else:
                print('False')
        else:
            print('False')
            
    is_year_leap(int(input('Введите год: ')))

Введите год: 2020
True


2. Функция принимает три числа a, b, c. Функция должна определить, существует ли треугольник с 
такими сторонами. Если треугольник существует, вернёт True, иначе False.

def tr(a, b, c):
    tmp = sorted([a, b, c])
    return tmp[2] < tmp[0] + tmp[1]

a = float(input("a= "))
b = float(input("b= "))
c = float(input("c= "))

if tr(a, b, c):
    print("True")
else:
    print("False")
a= 10
b= 20
c= 30
False


